{
  "teams": [
    {
      "name": "Executive",
      "members": [
        {
          "name": "Yousef Bulbulia",
          "imgSrc": "/team/2021/Yousef.jpg",
          "position": "Executive Director",
          "message": "Yousef is a fourth year student double majoring in math and CS. As the executive director, he helps create and support initiatives that help students grow themselves academically and professionally. When he's not busy, you can find him playing guitar, hanging out on UTM discord servers, or dying in Apex Legends.",
          "discord": "Yousef#4126",
          "email": "yousef.bulbulia@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/yousef-bulbulia/"
        },
        {
          "name": "VyVy Ngo",
          "imgSrc": "https://avatars.githubusercontent.com/u/45834118?s=460&u=83382baac5f0a500fa99646a4d5899fe391f7328&v=4",
          "position": "Vice Executive Director",
          "message": "As the vice-executive director, VyVy wants to create a welcoming computer science environment by providing students access to any information they need. She has a passion learning and grabs any information within her reach. In her spare time, she enjoys book illumination and playing Skyrim.",
          "discord": "SleepyVyvy#9713",
          "email": "vyvy.ngo@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/tuong-vy-n-614b4213b/"
        },
        {
          "name": "Lance Tugade",
          "imgSrc": "/team/2022/lance.png",
          "position": "Director of Communications",
          "message": "Lance is a third-year student majoring in Computer Science and minoring in both Math and Education Studies. In his free time you can find him coding useful scripts, exploring different cuisines and singing. I am also very interested in education and how we learn. I am always excited to learn about new ways we can learn CS better",
          "discord": "lance#0009"
        },
        {
          "name": "Kiara Callender",
          "imgSrc": "/team/2022/Kiara.png",
          "position": "Director of Operations",
          "message": "Third Year student at UTM studying Computer Science and Criminology with a minor in political science. She enjoys anything anime and gaming related and she loves dogs!",
          "discord": "kxanxc#6666",
          "email": "kiara.callender@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/kiara-callender-5757081b5/",
          "website": "https://github.com/kxanxc"
        },
        {
          "name": "Manjoy Malhotra",
          "imgSrc": "/team/2022/Joy.png",
          "position": "Director of Technology",
          "message": "Joy is a fifth year student double majoring in Computer Science and Professional Writing. She loves learning new tech, getting to explore different perspectives and learning about new culture’s, and teaching. She hopes to run initiatives that support students’ academic and career growth, and creating opportunities for students in the CS community!",
          "discord": "joy#7269"
        },
        {
          "name": "Michael Liut",
          "imgSrc": "/team/Michael.png",
          "position": "Faculty Advisor",
          "message": "Michael is a Computer Science educator who prides himself in fostering an environment of educational excellence through active and experiential learning. In recent years he has assisted in the development and implementation of active learning materials/strategies in several Computer Science courses at UTM. Michael enjoys travelling, and is an avid scuba diver.",
          "discord": "Mike's Here#5684",
          "email": " michael.liut@utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/mliut",
          "website": "https://www.michaelliut.ca/"
        }
      ]
    },
    {
      "name": "Communications",
      "members": [
        {
          "name": "Riya Shah",
          "imgSrc": "/team/2022/Riya.png",
          "position": "Communications Officer",
          "message": "Riya Shah is a third year UofT student majoring in Geographical Information Systems (GIS), minoring in Biology and Biomedical communications. She’s a natural collaborator, always eager to work with others to find innovative solutions to challenging problems. She loves watching netflix, hiking and painting aside from working on a variety of projects. In her free time, she really loves making vlogs of fun adventurous trips.",
          "discord": "Buzzbee#5972"
        },
        {
          "name": "Devishi Ranjan",
          "imgSrc": "/team/2022/Devishi.png",
          "position": "Communications Officer",
          "message": "Devishi is a fourth year computer science and CCIT double major. She is excited to work on CSSC initiatives!",
          "discord": "wovenstarlight#4579"
        }
      ]
    },
    {
      "name": "Logistics",
      "members": [
        {
          "name": "Le Nguyen",
          "imgSrc": "/team/2022/Le.png",
          "position": "Logistics Officer",
          "message": "Le is a second year statistics major with a double minor in math and computer science. She is interested in data analytics and data science. In her free time, she enjoys listening to music and watching youtube videos.",
          "discord": "lenguyen1605#1987"
        },
        {
          "name": "Kevin Ni",
          "imgSrc": "/team/2022/Kevin.png",
          "position": "Logistics Officer",
          "message": "Kevin is a second year specializing in computer science and majoring in statistics. His primary interests are in machine learning and data science. You might find him procrastinating by attending other people's lectures or watching YouTube in an empty classroom.",
          "discord": "Knee#5776"
        }
      ]
    },
    {
      "name": "Marketing",
      "members": [
        {
          "name": "Joshua Spencer",
          "imgSrc": "/team/2022/Joshua.png",
          "position": "Social Media Coordinator",
          "message": "I do not exist.",
          "discord": "urlord jumpsuit#5605"
        },
        {
          "name": "Emma Teng",
          "imgSrc": "/team/2022/Emma.png",
          "position": "Social Media Coordinator",
          "message": "Emma is a second-year CS and Stats major. She enjoys small projects and badminton. She also likes to rest but you can often spot her in the library struggling over stats and pulling all-nighters.",
          "discord": "serendipity#4185",
          "linkedin": "https://www.linkedin.com/in/e-teng/"
        }
      ]
    },
    {
      "name": "Technology",
      "members": [
        {
          "name": "Giang Bui",
          "imgSrc": "/team/2022/Giang.png",
          "position": "Technology Officer",
          "message": "Second year student studying Computer Science and Management, with a passion for software development. Giang loves learning and experimenting with new technologies. In her free time, Giang enjoys cooking (and eating, so feel free to DM her for food tour :D), knitting and reading (her favorite genre is detective fiction).",
          "discord": "huonggiangbui#4835",
          "email": "giang.bui@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/huonggiangbui/"
        },
        {
          "name": "Brian Zhang",
          "imgSrc": "/team/2022/brian.png",
          "position": "Technology Officer",
          "message": "Brian is a third year majoring in computer science and CCIT with a keen interest in front-end development. He enjoys high-level software development as a whole but otherwise you can find him in one of UTM's many student communities or watching YouTube videos and playing various video games!",
          "discord": "Pyo#8018",
          "email": "bria.zhang@mail.utoronto.ca"
        },
        {
          "name": "Sukhman Vig",
          "imgSrc": "/team/2022/Sukhman.png",
          "position": "Technology Officer",
          "message": "Sukhman Vig is a fourth year student at UofT studying Computer Science, Statistics and Communication Culture Information Technology. She is someone who is passionate about using technology, data analysis, and communication to solve complex problems, create new products and services, and bring people together in innovative ways. She is a creative, curious, and driven individual with a deep interest in learning how technology can be used to transform the world we live in.",
          "email": "sukhman.vig@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/sukhman-vig-9a5622164/"
        },
        {
          "name": "Manav Bhojak",
          "imgSrc": "/team/2022/manav.png",
          "position": "Technology Officer",
          "message": "Manav is a 4th year computer science major interested in backend development. He enjoys coding, playing video games, and going out with friends. ",
          "discord": "manu#0300",
          "email": "manav.bhojak@mail.utoronto.ca",
          "linkedin": "https://www.linkedin.com/in/manav-bhojak-788aa1169"
        }
      ]
    }
  ]
}
